EDT/УТ/src/Tasks/новаЗадачаРейсаМестнойДоставки/новаЗадачаРейсаМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>новаЗадачаРейсаМестнойДоставки</name>
  <attributes>
    <name>РейсОтменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсСогласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсЗапланирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсПодготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.новаПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланированиеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.новаЭтапыМестнойДоставки</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

EDT/УТ/src/Catalogs/новаЭтапыМестнойДоставки/новаЭтапыМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаЭтапыМестнойДоставки</name>
  <predefined>
    <items>
      <name>ЗавершениеМестнойДоставки</name>
      <description>Завершение местной доставки</description>
    </items>
    <items>
      <name>ЗавершениеПланирования</name>
      <description>Завершение планирования</description>
    </items>
    <items>
      <name>ОбработкаНедовозаМестнойДоставки</name>
      <description>Обработка недовоза местной доставки</description>
    </items>
    <items>
      <name>ПланированиеМестнойДоставки</name>
      <description>Планирование местной доставки</description>
    </items>
    <items>
      <name>ПодготовкаКВыездуМестнойДоставки</name>
      <description>Подготовка к выезду местной доставки</description>
    </items>
    <items>
      <name>СогласованиеМестнойДоставки</name>
      <description>Согласование местной доставки</description>
    </items>
    <items>
      <name>СогласованиеПланированияМестнойДоставки</name>
      <description>Согласование планирования местной доставки</description>
    </items>
    <items>
      <name>СопровождениеМестнойДоставки</name>
      <description>Сопровождение местной доставки</description>
    </items>
  </predefined>
  <attributes>
    <name>ВыполнятьЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Tasks/новаЗадачаРейсаМестнойДоставки/ObjectModule.bsl
Процедура ПередВыполнением(Отказ)
	новаУправлениеТранспортнойЛогистикой.ЗаполнитьАвтораИДатуВыполненияЗадачи(ЭтотОбъект);
	если Роль = Справочники.новаЭтапыМестнойДоставки.ЗавершениеПланирования Тогда
		
		Зап = Новый Запрос;
		
		Зап.Текст = "ВЫБРАТЬ
		            |	новаЗадачаРейсаМестнойДоставки.Ссылка
		            |ИЗ
		            |	Задача.новаЗадачаРейсаМестнойДоставки КАК новаЗадачаРейсаМестнойДоставки
		            |ГДЕ
		            |	новаЗадачаРейсаМестнойДоставки.Выполнена = ЛОЖЬ
		            |	И новаЗадачаРейсаМестнойДоставки.Роль = &ВыбЭтап
		            |	И новаЗадачаРейсаМестнойДоставки.БизнесПроцесс.ДатаНачала < &ДатаНачала";
		Зап.УстановитьПараметр("ВыбЭтап", Справочники.новаЭтапыМестнойДоставки.ЗавершениеМестнойДоставки);
		Зап.УстановитьПараметр("ДатаНачала", НачалоДня(БизнесПроцесс.ДатаНачала));
		
		Рез = Зап.Выполнить();			
		Если Не Рез.Пустой() Тогда
			#Если Клиент Тогда  
				Сообщить("Имеются прошлые незавершенные рейсы!", СтатусСообщения.Внимание);
			#КонецЕсли
		    Отказ = истина;
			Возврат;
		КонецеСли;	
		
	КонецеСли;	
КонецПроцедуры
